[
  
  {
  "name": "Hafiz Muhammad Ahmad Nawaz",
  "teaching_methodology": "Focuses mainly on teaching lab work, with a strong understanding of student problems. Places more emphasis on the learning process rather than assignments and quizzes.",
  "grading_criteria": "Grading is strict, though he gives marks easily for participation and understanding.",
  "assignment_taking": "Minimal focus on assignments.",
  "quiz_taking": "Minimal focus on quizzes.",
  "student_preference": "Liked by students who value the learning process over assessments.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Grading is strict, even though he gives marks easily for understanding.",
  "class_behaviour": "Supportive and understanding of student challenges, fosters a learning-oriented environment.",
  "description": "Hafiz Muhammad Ahmad Nawaz is a teacher who prioritizes the learning process, especially in lab-based courses. While he doesn't focus much on assignments or quizzes, he is very understanding of student problems and encourages learning. His grading is strict, but he gives marks easily for demonstrated understanding.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you're interested in focusing on learning and lab work rather than assignments and quizzes. His class is ideal for those who appreciate a more practical, learning-focused environment, but be aware of the strict grading."
  },
  {
  "name": "Shanza Zaman",
  "teaching_methodology": "Has a good understanding of the topic, repeats the topic multiple times to ensure students understand, asks many questions during class, encourages students to be prepared for unexpected questions.",
  "grading_criteria": "Easy checking for assignments, but strict evaluations for projects.",
  "assignment_taking": "Assignments are given with plagiarism checks.",
  "quiz_taking": "Takes more than 4 quizzes.",
  "student_preference": "Generally liked by students who attend the class regularly.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy assignment checking, but projects are evaluated strictly with TA involvement. TA’s evaluation may sometimes be less favorable, focusing on efficiency rather than knowledge.",
  "class_behaviour": "Strict, especially during project evaluations, but supportive during office hours and explains topics to students afterward if needed.",
  "description": "Shanza Zaman is a teacher with strong knowledge of the subject who repeats topics multiple times for better student understanding. She ensures that students are prepared by asking questions in class. While her assignments are graded easily, her project evaluations can be strict, often involving TA's who might prioritize efficiency over deep knowledge. She is very supportive during office hours and will explain any topic further if students need help.",
  "viva_taking": "No viva taking, but projects are evaluated with TA involvement.",
  "you_should_opt_or_not": "You should opt for her class if you are prepared to actively participate, stay attentive in class, and are looking for support during office hours. However, if you're not attending regularly or aren’t ready for strict project evaluations, it might not be the best fit."
  },
  {
    "name": "Abdullah Miraj",
    "teaching_methodology": "Interactive class with daily coding homework, regularly checks homework, explains topics in detail, uses own code in the compiler instead of pre-written code, helps students build logic from scratch.",
    "grading_criteria": "Relatively lenient grading, checks papers with easy marking, provides marks even for logic that is close to correct or approximately right.",
    "assignment_taking": "Assignments are difficult with a strict viva taking.",
    "quiz_taking": "Takes more than 4 quizzes with easy checking.",
    "student_preference": "Some students may run from his class or have short attendance due to their attitude of not learning, but he is a great choice for learning DSA if you're serious about it.",
    "girls_boys_difference": "No difference between boys and girls.",
    "paper_checking": "Checks papers with easy marking, focuses on logic over exact answers.",
    "class_behaviour": "Disciplined, professional, and encourages students to ask questions during class.",
    "description": "Sir Abdullah is an excellent teacher with strong coding skills. He focuses on helping students build their logic and explaining concepts in depth. He supports students during office hours and answers all their questions.",
    "viva_taking": "Strict viva taking, part of the assessment for assignments.",
    "you_should_opt_or_not": "You should opt for his class if you want to learn something seriously, especially in DSA, as he is supportive and skilled."
  },
  {
    "name": "Raybal Akhtar",
    "teaching_methodology": "Creates a learning environment in class, engages students with daily work, incorporates jokes to make the class enjoyable.",
    "grading_criteria": "Relative grading, easy paper checking.",
    "assignment_taking": "4 assignments with plagiarism checks.",
    "quiz_taking": "Takes more than 4 quizzes.",
    "student_preference": "Mostly liked by most students and preferred by many.",
    "girls_boys_difference": "No difference between boys and girls.",
    "paper_checking": "Easy paper checking, focuses on grading based on the understanding of concepts.",
    "class_behaviour": "Good class behaviour, understands student problems very well and creates a positive class environment.",
    "description": "Raybal Akhtar is a good teacher who tries to make learning fun and engaging while also ensuring that students understand the material. His class is interactive, and he is approachable for solving problems. He has a positive rapport with students.",
    "viva_taking": "No viva taking.",
    "you_should_opt_or_not": "You should opt for his class if you prefer a more relaxed and engaging learning environment with a good understanding of the material, though it's not very strict in terms of assessments."
  },
  {
    "name": "Ghulam Murtaza",
    "teaching_methodology": "Creates a learning environment, and includes jokes and interactive sessions to engage students.",
    "grading_criteria": "Relative grading with moderate paper checking.",
    "assignment_taking": "Takes projects with project viva.",
    "quiz_taking": "Takes more than 4 quizzes.",
    "student_preference": "Mostly liked by students, though his grading is slightly stricter.",
    "girls_boys_difference": "No difference between boys and girls.",
    "paper_checking": "Moderate checking, not too lenient.",
    "class_behaviour": "Sometimes strict, sometimes lenient, depending on the situation.",
    "description": "Ghulam Murtaza is a teacher who creates an engaging and interactive class environment. He evaluates students with moderate checking and includes projects with viva for comprehensive assessment.",
    "viva_taking": "Takes projects with project viva.",
    "you_should_opt_or_not": "You should opt for his class if you like a balanced approach with moderate assessments and the inclusion of projects. It’s a good choice if you're prepared for moderate checking and project evaluations."
  },
  {
  "name": "Farukh Liaqat",
  "teaching_methodology": "Very kind and approachable, explains topics in a simple and easy way, especially for theory-based subjects. After his lectures, no need to read slides or additional resources as his explanations are sufficient.",
  "grading_criteria": "Easy grading, gives marks easily in quizzes, finals, and assignments.",
  "assignment_taking": "Takes 4 assignments.",
  "quiz_taking": "Takes 4 quizzes.",
  "student_preference": "Mostly liked by students due to his friendly and easygoing approach.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking, grades leniently on quizzes and finals.",
  "class_behaviour": "Creates a very friendly and relaxed class environment.",
  "description": "Farukh Liaqat is a kind and understanding teacher who explains topics in an easy and clear manner, making complex theory-based subjects more approachable. He fosters a friendly class atmosphere and is very lenient in grading, making his class enjoyable and stress-free for students.",
  "viva_taking": "No viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer a relaxed and friendly learning environment with easy grading. His class is perfect if you want to learn theory-based subjects without the pressure of heavy assessments or extra resources."
  },
  {
  "name": "Aqsa Afzal",
  "teaching_methodology": "Explains topics very well, ensuring students understand the material clearly. Focuses on projects and makes sure to guide students throughout the process.",
  "grading_criteria": "Easy checking, but grading is strict. You need to work hard to achieve an A grade.",
  "assignment_taking": "Assignments are given with plagiarism checks.",
  "quiz_taking": "Takes approximately 5 quizzes.",
  "student_preference": "Generally liked by students who are willing to work hard and appreciate detailed explanations.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking, but strict grading. The emphasis is on ensuring the quality of work and understanding.",
  "class_behaviour": "Supportive teacher, always available to guide students and provide help when needed.",
  "description": "Aqsa Afzal is a supportive teacher who takes the time to explain topics thoroughly. While she uses easy checking for assignments and quizzes, the grading is strict, and students need to put in effort to earn top grades. She focuses on projects and ensures that plagiarism is checked.",
  "viva_taking": "No viva taking.",
  "you_should_opt_or_not": "You should opt for her class if you're willing to work hard for an A grade and value clear explanations. Her class is ideal if you prefer a focus on projects and are ready to take quizzes and assignments seriously."
  },
  {
  "name": "Muhammad Amir Waseem",
  "teaching_methodology": "Encourages students to learn independently, often suggesting they explore topics on their own and read from external sources like Google.",
  "grading_criteria": "Random checking and grading, with no consistent evaluation method.",
  "assignment_taking": "Assignments are given during lab sessions, but with no clear grading structure or consistent evaluation.",
  "quiz_taking": "No quizzes are taken.",
  "student_preference": "Preferred by students who prefer self-learning and independent exploration, but may not be suitable for those who need structured guidance.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Random checking and grading, with no well-defined evaluation of projects.",
  "class_behaviour": "Encourages a self-learning approach, but may not provide enough guidance for students who need more structured support.",
  "description": "Muhammad Amir Waseem is a teacher who emphasizes self-learning and exploration. He expects students to take the initiative in learning topics on their own. However, his grading and evaluation are random, and there is minimal structure to the assignments and projects.",
  "viva_taking": "No viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you are confident in your ability to learn independently and prefer exploring topics on your own. However, if you prefer more structured guidance and clear evaluations, his class may not be ideal."
  },
  {
  "name": "Anum Umera",
  "teaching_methodology": "Explains topics clearly and easily, focuses on making learning accessible. Works hard to ensure students understand the material.",
  "grading_criteria": "Easy grading with lenient checking.",
  "assignment_taking": "Takes approximately 4 assignments.",
  "quiz_taking": "Takes approximately 4 quizzes.",
  "student_preference": "Liked by students for her friendly and approachable nature. Her class is appreciated by those who value clarity and support.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking, lenient grading.",
  "class_behaviour": "Very kind and friendly, understands students well and offers support.",
  "description": "Anum Umera is a hardworking and honest teacher who explains topics in a simple and clear way. She is very supportive, understanding, and approachable, creating a positive learning environment. Her grading is easy, and she focuses on assignments, quizzes, and projects, with an emphasis on presentation.",
  "viva_taking": "No viva taking.",
  "you_should_opt_or_not": "You should opt for her class if you value a friendly and supportive learning environment with easy grading and a focus on presentations and projects. Her class is ideal for those who appreciate clarity and understanding in teaching."
  },
  {
  "name": "Afnan Iftikhar",
  "teaching_methodology": "Good at teaching theory-based subjects, explains the topics well but may sometimes focus more on the more intelligent students.",
  "grading_criteria": "Tight grading, assignments are strict and difficult, and grading is strict for quizzes and viva.",
  "assignment_taking": "Assignments are very strict and difficult.",
  "quiz_taking": "Takes quizzes with strict grading.",
  "student_preference": "Generally preferred by students who are comfortable with theory-based subjects and can handle difficult assignments, but might not be ideal for students who struggle with strict grading.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Strict grading, with a focus on accuracy and depth in answers.",
  "class_behaviour": "Sometimes more focused on intelligent students, creating a challenging environment for others.",
  "description": "Afnan Iftikhar is a good teacher for theory-based subjects, who explains topics clearly. However, her teaching can sometimes be more focused on intelligent students, making it challenging for others. Her grading is strict, and assignments are difficult, with a similarly tight grading approach for quizzes and viva.",
  "viva_taking": "Strict viva taking.",
  "you_should_opt_or_not": "You should opt for her class if you are comfortable with theory-based subjects and can handle strict assignments and grading. Her class may be challenging for those who struggle with difficult assignments and strict evaluations."
  },
  {
  "name": "Ali Haris",
  "teaching_methodology": "Has a very good understanding of coding-based subjects, explains concepts clearly. Frequently asks questions during class, encouraging students to be prepared.",
  "grading_criteria": "Relative grading with fair checking.",
  "assignment_taking": "Takes approximately 4 assignments.",
  "quiz_taking": "Takes approximately 4 quizzes.",
  "student_preference": "Preferred by students who are prepared and want a fair learning environment with an emphasis on coding skills.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Fair checking, relative grading approach.",
  "class_behaviour": "Encourages active participation and keeps students engaged by asking questions during class.",
  "description": "Ali Haris is a teacher with a strong understanding of coding-based subjects. His teaching style encourages student engagement through frequent questioning in class. He maintains a fair grading system and uses relative grading, making his class suitable for students who are prepared to actively participate in class discussions and assignments.",
  "viva_taking": "Easy viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you're comfortable with coding-based subjects and want a fair, interactive learning environment. His class is ideal for those who are ready to be active participants and prefer relative grading."
  },
  {
  "name": "Dr. Muhammad Aamir Khan",
  "teaching_methodology": "Disciplined and structured in his approach to teaching. While theory lectures may seem boring, his mathematical-based lectures are highly regarded and effective.",
  "grading_criteria": "Fair grading with absolute grading criteria, not relative grading.",
  "assignment_taking": "Takes approximately 4 assignments.",
  "quiz_taking": "Takes 5 quizzes.",
  "student_preference": "Preferred by students who appreciate structured learning and are comfortable with mathematical-based subjects.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Very fair checking, with no random checking. Grades are consistent and based on clear criteria.",
  "class_behaviour": "Good behavior, maintains discipline in the class while fostering a professional learning environment.",
  "description": "Dr. Muhammad Aamir Khan is known for his disciplined and structured approach to teaching. His theory lectures can sometimes be boring, but his mathematical-based lectures are very effective. He maintains fairness in his grading system, using absolute grading rather than relative grading, and ensures that all assessments are conducted fairly.",
  "viva_taking": "No viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you appreciate a structured and disciplined learning environment and are comfortable with mathematical-based content. His class is ideal for students who prefer absolute grading and fair assessments."
  },
  {
  "name": "Nauman Ahmad",
  "teaching_methodology": "Has an excellent understanding of the topic, and provides clear explanations. His teaching style is approachable and lenient, while still maintaining a structured approach.",
  "grading_criteria": "Grading is strict, though the checking is easy.",
  "assignment_taking": "Takes approximately 2-3 assignments.",
  "quiz_taking": "Takes approximately 5 quizzes.",
  "student_preference": "Preferred by students who appreciate a lenient teaching style but are okay with strict grading.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking, but strict grading.",
  "class_behaviour": "Maintains a structured, disciplined, and professional demeanor in class.",
  "description": "Nauman Ahmad is a teacher with excellent knowledge of the subject. His teaching style is lenient and easygoing, but he is disciplined and professional in his approach. While he provides easy checking for assignments and quizzes, the grading criteria are strict. His class structure is well-organized and clear, and he encourages an environment of learning.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer a lenient, understanding teacher who offers a structured learning environment. However, be prepared for strict grading."
  },
  {
  "name": "Nosheen Manzoor",
  "teaching_methodology": "Good at teaching theory-based subjects, explains concepts clearly and effectively.",
  "grading_criteria": "Easy grading with lenient checking.",
  "assignment_taking": "Takes approximately 3 assignments.",
  "quiz_taking": "Takes approximately 3 quizzes.",
  "student_preference": "Preferred by students who appreciate easy grading and good understanding of theory-based subjects.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking with lenient grading.",
  "class_behaviour": "Good behavior, understands student problems well, and maintains a supportive environment.",
  "description": "Nosheen Manzoor is an effective teacher for theory-based subjects. She has a clear teaching style and is known for her good behavior towards students. She is approachable and understands student problems, making her class comfortable. Her grading is easy, and she offers clear, lenient feedback on assignments and quizzes.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for her class if you're looking for an easygoing, supportive teacher in theory-based subjects with lenient grading."
  },
  {
    "name": "Hassan Ahmad",
    "teaching_methodology": "Cooperative teacher, great at teaching coding subjects. He ensures assignments are submitted on time but is understanding if any issues arise. He listens to student requests and provides necessary support.",
    "grading_criteria": "Strict evaluation of assignments, with strict vivas.",
    "assignment_taking": "Takes approximately 4 assignments.",
    "quiz_taking": "Takes approximately 4 quizzes.",
    "student_preference": "Preferred by students who are comfortable with a more structured and disciplined approach to coding subjects and appreciate strict evaluations.",
    "girls_boys_difference": "No difference between boys and girls.",
    "paper_checking": "Strict assignment evaluation and strict viva taking.",
    "class_behaviour": "Very cooperative, listens to students' requests, and is understanding when there are issues.",
    "description": "Hassan Ahmad is a cooperative teacher with a strong focus on coding subjects. He ensures that assignments are submitted on time and is flexible if students face issues. He maintains strict grading and viva evaluations but listens to student needs and offers support when required.",
    "viva_taking": "Strict viva taking.",
    "you_should_opt_or_not": "You should opt for his class if you're comfortable with a structured, disciplined approach to coding and are prepared for strict grading and vivas."
  },
  {
    "name": "Taila Jabeen",
    "teaching_methodology": "Lenient teacher who teaches concisely. She creates a light and enjoyable class environment and treats all students equally, without showing favoritism.",
    "grading_criteria": "Easy grading with lenient evaluations.",
    "assignment_taking": "Takes approximately 4 assignments.",
    "quiz_taking": "Takes approximately 4 quizzes.",
    "student_preference": "Preferred by students who enjoy a more relaxed and enjoyable class atmosphere without favoritism.",
    "girls_boys_difference": "No difference between boys and girls.",
    "paper_checking": "Easy grading and lenient evaluations.",
    "class_behaviour": "Creates a light, enjoyable class environment and treats all students equally.",
    "description": "Taila Jabeen is a lenient teacher who creates a friendly, enjoyable learning environment. She teaches concisely and treats all students equally, without favoritism. Her class is relaxed and suitable for students who prefer a more laid-back approach to learning.",
    "viva_taking": "No mention of strict viva taking.",
    "you_should_opt_or_not": "You should opt for her class if you prefer a more lenient, enjoyable learning environment where the focus is on concise teaching without favoritism."
  },
  {
  "name": "Arslan Shahid",
  "teaching_methodology": "Excellent teaching, clear and effective in explaining concepts.",
  "grading_criteria": "Fair checking, no strict viva.",
  "assignment_taking": "No mention of assignments.",
  "quiz_taking": "Takes approximately 3-4 quizzes.",
  "student_preference": "Preferred by students who appreciate clear and effective teaching.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Fair checking.",
  "class_behaviour": "No specific details provided.",
  "description": "Arslan Shahid is known for his excellent teaching, providing clear explanations and a strong understanding of the subject matter. He ensures fair checking of assignments and quizzes and does not conduct strict vivas.",
  "viva_taking": "No strict viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you value excellent teaching with clear explanations and fair checking, without the pressure of strict vivas."
  },
  {
  "name": "Ghulam Mustafa",
  "teaching_methodology": "Experienced teacher with good teaching skills. Focuses on delivering clear and effective lessons while maintaining structure.",
  "grading_criteria": "Relative grading.",
  "assignment_taking": "Takes approximately 4 assignments.",
  "quiz_taking": "Takes approximately 4 quizzes.",
  "student_preference": "Preferred by students who appreciate structure and are comfortable with relative grading.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Strict checking, in line with his strict assignment policy.",
  "class_behaviour": "Maintains a disciplined class environment with a focus on structure and student engagement.",
  "description": "Ghulam Mustafa is an experienced teacher with excellent teaching skills. He has a strict assignment and attendance policy, takes approximately 4 quizzes and assignments, and uses relative grading. Despite his strict policies, he is supportive and encourages students to succeed.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer a structured environment with clear expectations regarding assignments and attendance, and if you are comfortable with relative grading."
  },
  {
  "name": "Umair Ghazanfar",
  "teaching_methodology": "Good teacher with a clear and effective teaching style. Focuses on creating a supportive learning environment.",
  "grading_criteria": "Easy checking and lenient marking, making it easier for students to pass.",
  "assignment_taking": "Takes approximately 3 assignments.",
  "quiz_taking": "Takes approximately 3 quizzes.",
  "student_preference": "Preferred by students who prefer a more lenient grading approach and a supportive class environment.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking with lenient marking.",
  "class_behaviour": "Good behavior, creating a friendly and positive classroom atmosphere.",
  "description": "Umair Ghazanfar is a good teacher who creates a supportive and easy-going classroom environment. He ensures lenient checking and marking, making it easier for students to pass. He typically takes around 3 assignments and 3 quizzes during the course.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer an easy-going, supportive class environment with lenient grading and marking."
  },
  {
  "name": "Naveed Hussain",
  "teaching_methodology": "Thoroughly explains the topic and ensures students understand by revising the last class's topic before proceeding to the next one.",
  "grading_criteria": "Easy grading, making it easier for students to pass.",
  "assignment_taking": "No mention of assignments.",
  "quiz_taking": "No mention of quizzes.",
  "student_preference": "Preferred by students who appreciate a thorough, step-by-step approach to learning with an easy grading system.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking and grading.",
  "class_behaviour": "Creates a relaxed and supportive learning environment.",
  "description": "Naveed Hussain is known for his thorough approach to teaching. He ensures that students understand the material by revising the previous lesson before moving on to the next topic. His grading system is easy, and he makes sure that students pass the course with ease.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer a methodical and thorough teaching approach with easy grading and a relaxed learning environment."
  },
  {
  "name": "Muhammad Umar Farooq",
  "teaching_methodology": "Good teacher with a clear and effective teaching style.",
  "grading_criteria": "Easy checking and grading.",
  "assignment_taking": "No mention of assignments.",
  "quiz_taking": "No mention of quizzes.",
  "student_preference": "Preferred by students who appreciate easy grading and a supportive class environment.",
  "girls_boys_difference": "No difference between boys and girls.",
  "paper_checking": "Easy checking and grading.",
  "class_behaviour": "No specific details provided.",
  "description": "Muhammad Umar Farooq is a good teacher known for his easy checking and grading system. He creates a supportive environment that helps students succeed in their courses.",
  "viva_taking": "No mention of viva taking.",
  "you_should_opt_or_not": "You should opt for his class if you prefer easy grading and a supportive class environment."
  }
]  
  